garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1708.PIC
        <edc:SFRDef edc:access="---nnnnn" edc:cname="T0CKIPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="T0CKIPPS" edc:nzwidth="8" edc:por="---00010" edc:_addr="0xE11">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T0CKIPPS" edc:desc="" edc:mask="0x1f" edc:name="T0CKIPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="T1CKIPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="T1CKIPPS" edc:nzwidth="8" edc:por="---00101" edc:_addr="0xE12">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T1CKIPPS" edc:desc="" edc:mask="0x1f" edc:name="T1CKIPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="T1GPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="T1GPPS" edc:nzwidth="8" edc:por="---00100" edc:_addr="0xE13">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T1GPPS" edc:desc="" edc:mask="0x1f" edc:name="T1GPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CCP1PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="CCP1PPS" edc:nzwidth="8" edc:por="---10101" edc:_addr="0xE14">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP1PPS" edc:desc="" edc:mask="0x1f" edc:name="CCP1PPS" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CCP2PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="CCP2PPS" edc:nzwidth="8" edc:por="---10011" edc:_addr="0xE15">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP2PPS" edc:desc="" edc:mask="0x1f" edc:name="CCP2PPS" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0xE16"/>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="COGINPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="COGINPPS" edc:nzwidth="8" edc:por="---00010" edc:_addr="0xE17">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="COGINPPS" edc:desc="" edc:mask="0x1f" edc:name="COGINPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="8" edc:_addr="0xE18"/>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="SSPCLKPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="SSPCLKPPS" edc:nzwidth="8" edc:por="---01110" edc:_addr="0xE20">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SSPCLKPPS" edc:desc="" edc:mask="0x1f" edc:name="SSPCLKPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="SSPDATPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="SSPDATPPS" edc:nzwidth="8" edc:por="---01100" edc:_addr="0xE21">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SSPDATPPS" edc:desc="" edc:mask="0x1f" edc:name="SSPDATPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="SSPSSPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="SSPSSPPS" edc:nzwidth="8" edc:por="---10110" edc:_addr="0xE22">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SSPSSPPS" edc:desc="" edc:mask="0x1f" edc:name="SSPSSPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0xE23"/>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RXPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RXPPS" edc:nzwidth="8" edc:por="---01101" edc:_addr="0xE24">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXPPS" edc:desc="" edc:mask="0x1f" edc:name="RXPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CKPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="CKPPS" edc:nzwidth="8" edc:por="---01111" edc:_addr="0xE25">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CKPPS" edc:desc="" edc:mask="0x1f" edc:name="CKPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2" edc:_addr="0xE26"/>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CLCIN0PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="CLCIN0PPS" edc:nzwidth="8" edc:por="---10011" edc:_addr="0xE28">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLCIN0PPS" edc:desc="" edc:mask="0x1f" edc:name="CLCIN0PPS" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CLCIN1PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="CLCIN1PPS" edc:nzwidth="8" edc:por="---10100" edc:_addr="0xE29">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLCIN1PPS" edc:desc="" edc:mask="0x1f" edc:name="CLCIN1PPS" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CLCIN2PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="CLCIN2PPS" edc:nzwidth="8" edc:por="---10001" edc:_addr="0xE2A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLCIN2PPS" edc:desc="" edc:mask="0x1f" edc:name="CLCIN2PPS" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CLCIN3PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="CLCIN3PPS" edc:nzwidth="8" edc:por="---00101" edc:_addr="0xE2B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLCIN3PPS" edc:desc="" edc:mask="0x1f" edc:name="CLCIN3PPS" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="11" edc:_addr="0xE2C"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="29" edc:beginaddr="0xe80" edc:endaddr="0xef0" edc:regionid="sfr29">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xE80"/>
        <edc:AdjustPoint edc:offset="4" edc:_addr="0xE8C"/>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RA0PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RA0PPS" edc:nzwidth="8" edc:por="---00000" edc:_addr="0xE90">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RA0PPS" edc:desc="" edc:mask="0x1f" edc:name="RA0PPS" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RA1PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RA1PPS" edc:nzwidth="8" edc:por="---00000" edc:_addr="0xE91">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RA1PPS" edc:desc="" edc:mask="0x1f" edc:name="RA1PPS" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RA2PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RA2PPS" edc:nzwidth="8" edc:por="---00000" edc:_addr="0xE92">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RA2PPS" edc:desc="" edc:mask="0x1f" edc:name="RA2PPS" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0xE93"/>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RA4PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RA4PPS" edc:nzwidth="8" edc:por="---00000" edc:_addr="0xE94">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RA4PPS" edc:desc="" edc:mask="0x1f" edc:name="RA4PPS" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RA5PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RA5PPS" edc:nzwidth="8" edc:por="---00000" edc:_addr="0xE95">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RA5PPS" edc:desc="" edc:mask="0x1f" edc:name="RA5PPS" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="6" edc:_addr="0xE96"/>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RB4PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RB4PPS" edc:nzwidth="8" edc:por="---00000" edc:_addr="0xE9C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RB4PPS" edc:desc="" edc:mask="0x1f" edc:name="RB4PPS" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RB5PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RB5PPS" edc:nzwidth="8" edc:por="---00000" edc:_addr="0xE9D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RB5PPS" edc:desc="" edc:mask="0x1f" edc:name="RB5PPS" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RB6PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RB6PPS" edc:nzwidth="8" edc:por="---00000" edc:_addr="0xE9E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RB6PPS" edc:desc="" edc:mask="0x1f" edc:name="RB6PPS" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RB7PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RB7PPS" edc:nzwidth="8" edc:por="---00000" edc:_addr="0xE9F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RB7PPS" edc:desc="" edc:mask="0x1f" edc:name="RB7PPS" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RC0PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RC0PPS" edc:nzwidth="8" edc:por="---00000" edc:_addr="0xEA0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RC0PPS" edc:desc="" edc:mask="0x1f" edc:name="RC0PPS" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
